garyPenhook/PIC-Assembler/device_includes/pic16f13124.inc
// Register: ADACCU
#define ADACCU ADACCU
ADACCU                                   equ 01D18h
// bitfield definitions
ADACCU_ACC_POSN                          equ 0000h
ADACCU_ACC_POSITION                      equ 0000h
ADACCU_ACC_SIZE                          equ 0008h
ADACCU_ACC_LENGTH                        equ 0008h
ADACCU_ACC_MASK                          equ 00FFh
ADACCU_ADACC16_POSN                      equ 0000h
ADACCU_ADACC16_POSITION                  equ 0000h
ADACCU_ADACC16_SIZE                      equ 0001h
ADACCU_ADACC16_LENGTH                    equ 0001h
ADACCU_ADACC16_MASK                      equ 0001h
ADACCU_ADACC17_POSN                      equ 0001h
ADACCU_ADACC17_POSITION                  equ 0001h
ADACCU_ADACC17_SIZE                      equ 0001h
ADACCU_ADACC17_LENGTH                    equ 0001h
ADACCU_ADACC17_MASK                      equ 0002h
ADACCU_ADACC_POSN                        equ 0000h
ADACCU_ADACC_POSITION                    equ 0000h
ADACCU_ADACC_SIZE                        equ 0008h
ADACCU_ADACC_LENGTH                      equ 0008h
ADACCU_ADACC_MASK                        equ 00FFh
ADACCU_ACC16_POSN                        equ 0000h
ADACCU_ACC16_POSITION                    equ 0000h
ADACCU_ACC16_SIZE                        equ 0001h
ADACCU_ACC16_LENGTH                      equ 0001h
ADACCU_ACC16_MASK                        equ 0001h
ADACCU_ACC17_POSN                        equ 0001h
ADACCU_ACC17_POSITION                    equ 0001h
ADACCU_ACC17_SIZE                        equ 0001h
ADACCU_ACC17_LENGTH                      equ 0001h
ADACCU_ACC17_MASK                        equ 0002h

// Register: ADCNT
#define ADCNT ADCNT
ADCNT                                    equ 01D19h
// bitfield definitions
ADCNT_CNT_POSN                           equ 0000h
ADCNT_CNT_POSITION                       equ 0000h
ADCNT_CNT_SIZE                           equ 0008h
ADCNT_CNT_LENGTH                         equ 0008h
ADCNT_CNT_MASK                           equ 00FFh
ADCNT_ADCNT0_POSN                        equ 0000h
ADCNT_ADCNT0_POSITION                    equ 0000h
ADCNT_ADCNT0_SIZE                        equ 0001h
ADCNT_ADCNT0_LENGTH                      equ 0001h
ADCNT_ADCNT0_MASK                        equ 0001h
ADCNT_ADCNT1_POSN                        equ 0001h
ADCNT_ADCNT1_POSITION                    equ 0001h
ADCNT_ADCNT1_SIZE                        equ 0001h
ADCNT_ADCNT1_LENGTH                      equ 0001h
ADCNT_ADCNT1_MASK                        equ 0002h
ADCNT_ADCNT2_POSN                        equ 0002h
ADCNT_ADCNT2_POSITION                    equ 0002h
ADCNT_ADCNT2_SIZE                        equ 0001h
ADCNT_ADCNT2_LENGTH                      equ 0001h
ADCNT_ADCNT2_MASK                        equ 0004h
ADCNT_ADCNT3_POSN                        equ 0003h
ADCNT_ADCNT3_POSITION                    equ 0003h
ADCNT_ADCNT3_SIZE                        equ 0001h
ADCNT_ADCNT3_LENGTH                      equ 0001h
ADCNT_ADCNT3_MASK                        equ 0008h
ADCNT_ADCNT4_POSN                        equ 0004h
ADCNT_ADCNT4_POSITION                    equ 0004h
ADCNT_ADCNT4_SIZE                        equ 0001h
ADCNT_ADCNT4_LENGTH                      equ 0001h
ADCNT_ADCNT4_MASK                        equ 0010h
ADCNT_ADCNT5_POSN                        equ 0005h
ADCNT_ADCNT5_POSITION                    equ 0005h
ADCNT_ADCNT5_SIZE                        equ 0001h
ADCNT_ADCNT5_LENGTH                      equ 0001h
ADCNT_ADCNT5_MASK                        equ 0020h
ADCNT_ADCNT6_POSN                        equ 0006h
ADCNT_ADCNT6_POSITION                    equ 0006h
ADCNT_ADCNT6_SIZE                        equ 0001h
ADCNT_ADCNT6_LENGTH                      equ 0001h
ADCNT_ADCNT6_MASK                        equ 0040h
ADCNT_ADCNT7_POSN                        equ 0007h
ADCNT_ADCNT7_POSITION                    equ 0007h
ADCNT_ADCNT7_SIZE                        equ 0001h
ADCNT_ADCNT7_LENGTH                      equ 0001h
ADCNT_ADCNT7_MASK                        equ 0080h
ADCNT_ADCNT_POSN                         equ 0000h
ADCNT_ADCNT_POSITION                     equ 0000h
ADCNT_ADCNT_SIZE                         equ 0008h
ADCNT_ADCNT_LENGTH                       equ 0008h
ADCNT_ADCNT_MASK                         equ 00FFh
ADCNT_CNT0_POSN                          equ 0000h
ADCNT_CNT0_POSITION                      equ 0000h
ADCNT_CNT0_SIZE                          equ 0001h
ADCNT_CNT0_LENGTH                        equ 0001h
ADCNT_CNT0_MASK                          equ 0001h
ADCNT_CNT1_POSN                          equ 0001h
ADCNT_CNT1_POSITION                      equ 0001h
ADCNT_CNT1_SIZE                          equ 0001h
ADCNT_CNT1_LENGTH                        equ 0001h
ADCNT_CNT1_MASK                          equ 0002h
ADCNT_CNT2_POSN                          equ 0002h
ADCNT_CNT2_POSITION                      equ 0002h
ADCNT_CNT2_SIZE                          equ 0001h
ADCNT_CNT2_LENGTH                        equ 0001h
ADCNT_CNT2_MASK                          equ 0004h
ADCNT_CNT3_POSN                          equ 0003h
ADCNT_CNT3_POSITION                      equ 0003h
ADCNT_CNT3_SIZE                          equ 0001h
ADCNT_CNT3_LENGTH                        equ 0001h
ADCNT_CNT3_MASK                          equ 0008h
ADCNT_CNT4_POSN                          equ 0004h
ADCNT_CNT4_POSITION                      equ 0004h
ADCNT_CNT4_SIZE                          equ 0001h
ADCNT_CNT4_LENGTH                        equ 0001h
ADCNT_CNT4_MASK                          equ 0010h
ADCNT_CNT5_POSN                          equ 0005h
ADCNT_CNT5_POSITION                      equ 0005h
ADCNT_CNT5_SIZE                          equ 0001h
ADCNT_CNT5_LENGTH                        equ 0001h
ADCNT_CNT5_MASK                          equ 0020h
ADCNT_CNT6_POSN                          equ 0006h
ADCNT_CNT6_POSITION                      equ 0006h
ADCNT_CNT6_SIZE                          equ 0001h
ADCNT_CNT6_LENGTH                        equ 0001h
ADCNT_CNT6_MASK                          equ 0040h
ADCNT_CNT7_POSN                          equ 0007h
ADCNT_CNT7_POSITION                      equ 0007h
ADCNT_CNT7_SIZE                          equ 0001h
ADCNT_CNT7_LENGTH                        equ 0001h
ADCNT_CNT7_MASK                          equ 0080h

// Register: ADRPT
#define ADRPT ADRPT
ADRPT                                    equ 01D1Ah
// bitfield definitions
ADRPT_RPT_POSN                           equ 0000h
ADRPT_RPT_POSITION                       equ 0000h
ADRPT_RPT_SIZE                           equ 0008h
ADRPT_RPT_LENGTH                         equ 0008h
ADRPT_RPT_MASK                           equ 00FFh
ADRPT_ADRPT0_POSN                        equ 0000h
ADRPT_ADRPT0_POSITION                    equ 0000h
ADRPT_ADRPT0_SIZE                        equ 0001h
ADRPT_ADRPT0_LENGTH                      equ 0001h
ADRPT_ADRPT0_MASK                        equ 0001h
ADRPT_ADRPT1_POSN                        equ 0001h
ADRPT_ADRPT1_POSITION                    equ 0001h
ADRPT_ADRPT1_SIZE                        equ 0001h
ADRPT_ADRPT1_LENGTH                      equ 0001h
ADRPT_ADRPT1_MASK                        equ 0002h
ADRPT_ADRPT2_POSN                        equ 0002h
ADRPT_ADRPT2_POSITION                    equ 0002h
ADRPT_ADRPT2_SIZE                        equ 0001h
ADRPT_ADRPT2_LENGTH                      equ 0001h
ADRPT_ADRPT2_MASK                        equ 0004h
ADRPT_ADRPT3_POSN                        equ 0003h
ADRPT_ADRPT3_POSITION                    equ 0003h
ADRPT_ADRPT3_SIZE                        equ 0001h
ADRPT_ADRPT3_LENGTH                      equ 0001h
ADRPT_ADRPT3_MASK                        equ 0008h
ADRPT_ADRPT4_POSN                        equ 0004h
ADRPT_ADRPT4_POSITION                    equ 0004h
ADRPT_ADRPT4_SIZE                        equ 0001h
ADRPT_ADRPT4_LENGTH                      equ 0001h
ADRPT_ADRPT4_MASK                        equ 0010h
ADRPT_ADRPT5_POSN                        equ 0005h
ADRPT_ADRPT5_POSITION                    equ 0005h
ADRPT_ADRPT5_SIZE                        equ 0001h
ADRPT_ADRPT5_LENGTH                      equ 0001h
ADRPT_ADRPT5_MASK                        equ 0020h
ADRPT_ADRPT6_POSN                        equ 0006h
ADRPT_ADRPT6_POSITION                    equ 0006h
ADRPT_ADRPT6_SIZE                        equ 0001h
ADRPT_ADRPT6_LENGTH                      equ 0001h
ADRPT_ADRPT6_MASK                        equ 0040h
ADRPT_ADRPT7_POSN                        equ 0007h
ADRPT_ADRPT7_POSITION                    equ 0007h
ADRPT_ADRPT7_SIZE                        equ 0001h
ADRPT_ADRPT7_LENGTH                      equ 0001h
ADRPT_ADRPT7_MASK                        equ 0080h
ADRPT_ADRPT_POSN                         equ 0000h
ADRPT_ADRPT_POSITION                     equ 0000h
ADRPT_ADRPT_SIZE                         equ 0008h
ADRPT_ADRPT_LENGTH                       equ 0008h
ADRPT_ADRPT_MASK                         equ 00FFh
ADRPT_RPT0_POSN                          equ 0000h
ADRPT_RPT0_POSITION                      equ 0000h
ADRPT_RPT0_SIZE                          equ 0001h
ADRPT_RPT0_LENGTH                        equ 0001h
ADRPT_RPT0_MASK                          equ 0001h
ADRPT_RPT1_POSN                          equ 0001h
ADRPT_RPT1_POSITION                      equ 0001h
ADRPT_RPT1_SIZE                          equ 0001h
ADRPT_RPT1_LENGTH                        equ 0001h
ADRPT_RPT1_MASK                          equ 0002h
ADRPT_RPT2_POSN                          equ 0002h
ADRPT_RPT2_POSITION                      equ 0002h
ADRPT_RPT2_SIZE                          equ 0001h
ADRPT_RPT2_LENGTH                        equ 0001h
ADRPT_RPT2_MASK                          equ 0004h
ADRPT_RPT3_POSN                          equ 0003h
ADRPT_RPT3_POSITION                      equ 0003h
ADRPT_RPT3_SIZE                          equ 0001h
ADRPT_RPT3_LENGTH                        equ 0001h
ADRPT_RPT3_MASK                          equ 0008h
ADRPT_RPT4_POSN                          equ 0004h
ADRPT_RPT4_POSITION                      equ 0004h
ADRPT_RPT4_SIZE                          equ 0001h
ADRPT_RPT4_LENGTH                        equ 0001h
ADRPT_RPT4_MASK                          equ 0010h
ADRPT_RPT5_POSN                          equ 0005h
ADRPT_RPT5_POSITION                      equ 0005h
ADRPT_RPT5_SIZE                          equ 0001h
ADRPT_RPT5_LENGTH                        equ 0001h
ADRPT_RPT5_MASK                          equ 0020h
ADRPT_RPT6_POSN                          equ 0006h
ADRPT_RPT6_POSITION                      equ 0006h
ADRPT_RPT6_SIZE                          equ 0001h
ADRPT_RPT6_LENGTH                        equ 0001h
ADRPT_RPT6_MASK                          equ 0040h
ADRPT_RPT7_POSN                          equ 0007h
ADRPT_RPT7_POSITION                      equ 0007h
ADRPT_RPT7_SIZE                          equ 0001h
ADRPT_RPT7_LENGTH                        equ 0001h
ADRPT_RPT7_MASK                          equ 0080h

// Register: ADPREVL
#define ADPREVL ADPREVL
ADPREVL                                  equ 01D1Bh
// bitfield definitions
ADPREVL_PREV_POSN                        equ 0000h
ADPREVL_PREV_POSITION                    equ 0000h
ADPREVL_PREV_SIZE                        equ 0008h
ADPREVL_PREV_LENGTH                      equ 0008h
ADPREVL_PREV_MASK                        equ 00FFh
ADPREVL_ADPREV0_POSN                     equ 0000h
ADPREVL_ADPREV0_POSITION                 equ 0000h
ADPREVL_ADPREV0_SIZE                     equ 0001h
ADPREVL_ADPREV0_LENGTH                   equ 0001h
ADPREVL_ADPREV0_MASK                     equ 0001h
ADPREVL_ADPREV1_POSN                     equ 0001h
ADPREVL_ADPREV1_POSITION                 equ 0001h
ADPREVL_ADPREV1_SIZE                     equ 0001h
ADPREVL_ADPREV1_LENGTH                   equ 0001h
ADPREVL_ADPREV1_MASK                     equ 0002h
ADPREVL_ADPREV2_POSN                     equ 0002h
ADPREVL_ADPREV2_POSITION                 equ 0002h
ADPREVL_ADPREV2_SIZE                     equ 0001h
ADPREVL_ADPREV2_LENGTH                   equ 0001h
ADPREVL_ADPREV2_MASK                     equ 0004h
ADPREVL_ADPREV3_POSN                     equ 0003h
ADPREVL_ADPREV3_POSITION                 equ 0003h
ADPREVL_ADPREV3_SIZE                     equ 0001h
ADPREVL_ADPREV3_LENGTH                   equ 0001h
ADPREVL_ADPREV3_MASK                     equ 0008h
ADPREVL_ADPREV4_POSN                     equ 0004h
ADPREVL_ADPREV4_POSITION                 equ 0004h
ADPREVL_ADPREV4_SIZE                     equ 0001h
ADPREVL_ADPREV4_LENGTH                   equ 0001h
ADPREVL_ADPREV4_MASK                     equ 0010h
ADPREVL_ADPREV5_POSN                     equ 0005h
ADPREVL_ADPREV5_POSITION                 equ 0005h
ADPREVL_ADPREV5_SIZE                     equ 0001h
ADPREVL_ADPREV5_LENGTH                   equ 0001h
ADPREVL_ADPREV5_MASK                     equ 0020h
ADPREVL_ADPREV6_POSN                     equ 0006h
ADPREVL_ADPREV6_POSITION                 equ 0006h
ADPREVL_ADPREV6_SIZE                     equ 0001h
ADPREVL_ADPREV6_LENGTH                   equ 0001h
ADPREVL_ADPREV6_MASK                     equ 0040h
ADPREVL_ADPREV7_POSN                     equ 0007h
ADPREVL_ADPREV7_POSITION                 equ 0007h
ADPREVL_ADPREV7_SIZE                     equ 0001h
ADPREVL_ADPREV7_LENGTH                   equ 0001h
ADPREVL_ADPREV7_MASK                     equ 0080h
ADPREVL_ADPREV_POSN                      equ 0000h
ADPREVL_ADPREV_POSITION                  equ 0000h
ADPREVL_ADPREV_SIZE                      equ 0008h
ADPREVL_ADPREV_LENGTH                    equ 0008h
ADPREVL_ADPREV_MASK                      equ 00FFh
ADPREVL_PREV0_POSN                       equ 0000h
ADPREVL_PREV0_POSITION                   equ 0000h
ADPREVL_PREV0_SIZE                       equ 0001h
ADPREVL_PREV0_LENGTH                     equ 0001h
ADPREVL_PREV0_MASK                       equ 0001h
ADPREVL_PREV1_POSN                       equ 0001h
ADPREVL_PREV1_POSITION                   equ 0001h
ADPREVL_PREV1_SIZE                       equ 0001h
ADPREVL_PREV1_LENGTH                     equ 0001h
ADPREVL_PREV1_MASK                       equ 0002h
ADPREVL_PREV2_POSN                       equ 0002h
ADPREVL_PREV2_POSITION                   equ 0002h
ADPREVL_PREV2_SIZE                       equ 0001h
ADPREVL_PREV2_LENGTH                     equ 0001h
ADPREVL_PREV2_MASK                       equ 0004h
ADPREVL_PREV3_POSN                       equ 0003h
ADPREVL_PREV3_POSITION                   equ 0003h
ADPREVL_PREV3_SIZE                       equ 0001h
ADPREVL_PREV3_LENGTH                     equ 0001h
ADPREVL_PREV3_MASK                       equ 0008h
ADPREVL_PREV4_POSN                       equ 0004h
ADPREVL_PREV4_POSITION                   equ 0004h
ADPREVL_PREV4_SIZE                       equ 0001h
ADPREVL_PREV4_LENGTH                     equ 0001h
ADPREVL_PREV4_MASK                       equ 0010h
ADPREVL_PREV5_POSN                       equ 0005h
ADPREVL_PREV5_POSITION                   equ 0005h
ADPREVL_PREV5_SIZE                       equ 0001h
ADPREVL_PREV5_LENGTH                     equ 0001h
ADPREVL_PREV5_MASK                       equ 0020h
ADPREVL_PREV6_POSN                       equ 0006h
ADPREVL_PREV6_POSITION                   equ 0006h
ADPREVL_PREV6_SIZE                       equ 0001h
ADPREVL_PREV6_LENGTH                     equ 0001h
ADPREVL_PREV6_MASK                       equ 0040h
ADPREVL_PREV7_POSN                       equ 0007h
ADPREVL_PREV7_POSITION                   equ 0007h
ADPREVL_PREV7_SIZE                       equ 0001h
ADPREVL_PREV7_LENGTH                     equ 0001h
ADPREVL_PREV7_MASK                       equ 0080h

