garyPenhook/PIC-Assembler/device_includes/pic16f13124.inc
#define R_nW                             BANKMASK(SSP1STAT), 2
#define R_nW1                            BANKMASK(SSP1STAT), 2
#define S2                               BANKMASK(SSP1STAT), 3
#define SBCDE                            BANKMASK(SSP1CON3), 2
#define SBOREN                           BANKMASK(BORCON), 7
#define SCANIE                           BANKMASK(PIE1), 2
#define SCANIF                           BANKMASK(PIR1), 2
#define SCANMD                           BANKMASK(PMD0), 2
#define SCIE                             BANKMASK(SSP1CON3), 5
#define SCKP                             BANKMASK(BAUD1CON), 4
#define SDAHT                            BANKMASK(SSP1CON3), 3
#define SEN1                             BANKMASK(SSP1CON2), 0
#define SENDB                            BANKMASK(TX1STA), 3
#define SETUP0                           BANKMASK(CRCCON0), 2
#define SETUP1                           BANKMASK(CRCCON0), 3
#define SFOR                             BANKMASK(OSCSTAT), 1
#define SGO                              BANKMASK(SCANCON0), 6
#define SHIFT0                           BANKMASK(CRCSHFTL), 0
#define SHIFT1                           BANKMASK(CRCSHFTL), 1
#define SHIFT10                          BANKMASK(CRCSHFTH), 2
#define SHIFT11                          BANKMASK(CRCSHFTH), 3
#define SHIFT12                          BANKMASK(CRCSHFTH), 4
#define SHIFT13                          BANKMASK(CRCSHFTH), 5
#define SHIFT14                          BANKMASK(CRCSHFTH), 6
#define SHIFT15                          BANKMASK(CRCSHFTH), 7
#define SHIFT16                          BANKMASK(CRCSHFTU), 0
#define SHIFT17                          BANKMASK(CRCSHFTU), 1
#define SHIFT18                          BANKMASK(CRCSHFTU), 2
#define SHIFT19                          BANKMASK(CRCSHFTU), 3
#define SHIFT2                           BANKMASK(CRCSHFTL), 2
#define SHIFT20                          BANKMASK(CRCSHFTU), 4
#define SHIFT21                          BANKMASK(CRCSHFTU), 5
#define SHIFT22                          BANKMASK(CRCSHFTU), 6
#define SHIFT23                          BANKMASK(CRCSHFTU), 7
#define SHIFT24                          BANKMASK(CRCSHFTT), 0
#define SHIFT25                          BANKMASK(CRCSHFTT), 1
#define SHIFT26                          BANKMASK(CRCSHFTT), 2
#define SHIFT27                          BANKMASK(CRCSHFTT), 3
#define SHIFT28                          BANKMASK(CRCSHFTT), 4
#define SHIFT29                          BANKMASK(CRCSHFTT), 5
#define SHIFT3                           BANKMASK(CRCSHFTL), 3
#define SHIFT30                          BANKMASK(CRCSHFTT), 6
#define SHIFT31                          BANKMASK(CRCSHFTT), 7
#define SHIFT4                           BANKMASK(CRCSHFTL), 4
#define SHIFT5                           BANKMASK(CRCSHFTL), 5
#define SHIFT6                           BANKMASK(CRCSHFTL), 6
#define SHIFT7                           BANKMASK(CRCSHFTL), 7
#define SHIFT8                           BANKMASK(CRCSHFTH), 0
#define SHIFT9                           BANKMASK(CRCSHFTH), 1
#define SHIFTM                           BANKMASK(CRCCON0), 1
#define SLCT0                            BANKMASK(CLCSELECT), 0
#define SLCT1                            BANKMASK(CLCSELECT), 1
#define SLRA0                            BANKMASK(SLRCONA), 0
#define SLRA1                            BANKMASK(SLRCONA), 1
#define SLRA2                            BANKMASK(SLRCONA), 2
#define SLRA4                            BANKMASK(SLRCONA), 4
#define SLRA5                            BANKMASK(SLRCONA), 5
#define SLRC0                            BANKMASK(SLRCONC), 0
#define SLRC1                            BANKMASK(SLRCONC), 1
#define SLRC2                            BANKMASK(SLRCONC), 2
#define SLRC3                            BANKMASK(SLRCONC), 3
#define SLRC4                            BANKMASK(SLRCONC), 4
#define SLRC5                            BANKMASK(SLRCONC), 5
#define SMP                              BANKMASK(SSP1STAT), 7
#define SMP1                             BANKMASK(SSP1STAT), 7
#define SOI                              BANKMASK(ADCON3), 3
#define SPEN                             BANKMASK(RC1STA), 7
#define SREN                             BANKMASK(RC1STA), 5
#define SSP1CLKPPS0                      BANKMASK(SSP1CLKPPS), 0
#define SSP1CLKPPS1                      BANKMASK(SSP1CLKPPS), 1
#define SSP1CLKPPS2                      BANKMASK(SSP1CLKPPS), 2
#define SSP1CLKPPS3                      BANKMASK(SSP1CLKPPS), 3
#define SSP1CLKPPS4                      BANKMASK(SSP1CLKPPS), 4
#define SSP1DATPPS0                      BANKMASK(SSP1DATPPS), 0
#define SSP1DATPPS1                      BANKMASK(SSP1DATPPS), 1
#define SSP1DATPPS2                      BANKMASK(SSP1DATPPS), 2
#define SSP1DATPPS3                      BANKMASK(SSP1DATPPS), 3
#define SSP1DATPPS4                      BANKMASK(SSP1DATPPS), 4
#define SSP1IE                           BANKMASK(PIE5), 2
#define SSP1IF                           BANKMASK(PIR5), 2
#define SSP1SSPPS0                       BANKMASK(SSP1SSPPS), 0
#define SSP1SSPPS1                       BANKMASK(SSP1SSPPS), 1
#define SSP1SSPPS2                       BANKMASK(SSP1SSPPS), 2
#define SSP1SSPPS3                       BANKMASK(SSP1SSPPS), 3
#define SSP1SSPPS4                       BANKMASK(SSP1SSPPS), 4
#define SSPEN                            BANKMASK(SSP1CON1), 5
#define SSPEN1                           BANKMASK(SSP1CON1), 5
#define SSPM0                            BANKMASK(SSP1CON1), 0
#define SSPM01                           BANKMASK(SSP1CON1), 0
#define SSPM1                            BANKMASK(SSP1CON1), 1
#define SSPM11                           BANKMASK(SSP1CON1), 1
#define SSPM2                            BANKMASK(SSP1CON1), 2
#define SSPM21                           BANKMASK(SSP1CON1), 2
#define SSPM3                            BANKMASK(SSP1CON1), 3
#define SSPM31                           BANKMASK(SSP1CON1), 3
#define SSPOV                            BANKMASK(SSP1CON1), 6
#define SSPOV1                           BANKMASK(SSP1CON1), 6
#define START                            BANKMASK(SSP1STAT), 3
#define START1                           BANKMASK(SSP1STAT), 3
#define STAT0                            BANKMASK(ADSTAT), 0
#define STAT1                            BANKMASK(ADSTAT), 1
#define STAT2                            BANKMASK(ADSTAT), 2
#define STATE                            BANKMASK(WDTTMR), 2
#define STATUS_SHAD0                     BANKMASK(STATUS_SHAD), 0
#define STATUS_SHAD1                     BANKMASK(STATUS_SHAD), 1
#define STATUS_SHAD2                     BANKMASK(STATUS_SHAD), 2
#define STKOVF                           BANKMASK(PCON0), 7
#define STKPTR0                          BANKMASK(STKPTR), 0
#define STKPTR1                          BANKMASK(STKPTR), 1
#define STKPTR2                          BANKMASK(STKPTR), 2
#define STKPTR3                          BANKMASK(STKPTR), 3
#define STKPTR4                          BANKMASK(STKPTR), 4
#define STKUNF                           BANKMASK(PCON0), 6
#define STOP                             BANKMASK(SSP1STAT), 4
#define STOP1                            BANKMASK(SSP1STAT), 4
#define STPT0                            BANKMASK(ADSTPTL), 0
#define STPT1                            BANKMASK(ADSTPTL), 1
#define STPT10                           BANKMASK(ADSTPTH), 2
#define STPT11                           BANKMASK(ADSTPTH), 3
#define STPT12                           BANKMASK(ADSTPTH), 4
#define STPT13                           BANKMASK(ADSTPTH), 5
#define STPT15                           BANKMASK(ADSTPTH), 6
#define STPT16                           BANKMASK(ADSTPTH), 7
#define STPT2                            BANKMASK(ADSTPTL), 2
#define STPT3                            BANKMASK(ADSTPTL), 3
#define STPT4                            BANKMASK(ADSTPTL), 4
#define STPT5                            BANKMASK(ADSTPTL), 5
#define STPT6                            BANKMASK(ADSTPTL), 6
#define STPT7                            BANKMASK(ADSTPTL), 7
#define STPT8                            BANKMASK(ADSTPTH), 0
#define STPT9                            BANKMASK(ADSTPTH), 1
#define SWDTEN                           BANKMASK(WDTCON0), 0
#define SYSCMD                           BANKMASK(PMD0), 3
#define T016BIT                          BANKMASK(T0CON0), 4
#define T0ASYNC                          BANKMASK(T0CON1), 4
#define T0CKIPPS0                        BANKMASK(T0CKIPPS), 0
#define T0CKIPPS1                        BANKMASK(T0CKIPPS), 1
#define T0CKIPPS2                        BANKMASK(T0CKIPPS), 2
#define T0CKIPPS3                        BANKMASK(T0CKIPPS), 3
#define T0CKIPPS4                        BANKMASK(T0CKIPPS), 4
#define T0CKPS0                          BANKMASK(T0CON1), 0
#define T0CKPS1                          BANKMASK(T0CON1), 1
#define T0CKPS2                          BANKMASK(T0CON1), 2
#define T0CKPS3                          BANKMASK(T0CON1), 3
#define T0CS0                            BANKMASK(T0CON1), 5
#define T0CS1                            BANKMASK(T0CON1), 6
#define T0CS2                            BANKMASK(T0CON1), 7
#define T0EN                             BANKMASK(T0CON0), 7
#define T0MD16                           BANKMASK(T0CON0), 4
#define T0OUT                            BANKMASK(T0CON0), 5
#define T0OUTPS0                         BANKMASK(T0CON0), 0
#define T0OUTPS1                         BANKMASK(T0CON0), 1
#define T0OUTPS2                         BANKMASK(T0CON0), 2
#define T0OUTPS3                         BANKMASK(T0CON0), 3
#define T0PR0                            BANKMASK(TMR0H), 0
#define T0PR1                            BANKMASK(TMR0H), 1
#define T0PR2                            BANKMASK(TMR0H), 2
#define T0PR3                            BANKMASK(TMR0H), 3
#define T0PR4                            BANKMASK(TMR0H), 4
#define T0PR5                            BANKMASK(TMR0H), 5
#define T0PR6                            BANKMASK(TMR0H), 6
#define T0PR7                            BANKMASK(TMR0H), 7
#define T1CKIPPS0                        BANKMASK(T1CKIPPS), 0
#define T1CKIPPS1                        BANKMASK(T1CKIPPS), 1
#define T1CKIPPS2                        BANKMASK(T1CKIPPS), 2
#define T1CKIPPS3                        BANKMASK(T1CKIPPS), 3
#define T1CKIPPS4                        BANKMASK(T1CKIPPS), 4
#define T1CKPS0                          BANKMASK(T1CON), 4
#define T1CKPS1                          BANKMASK(T1CON), 5
#define T1CS0                            BANKMASK(T1CLK), 0
#define T1CS1                            BANKMASK(T1CLK), 1
#define T1CS2                            BANKMASK(T1CLK), 2
#define T1CS3                            BANKMASK(T1CLK), 3
#define T1CS4                            BANKMASK(T1CLK), 4
#define T1GE                             BANKMASK(T1GCON), 7
#define T1GGO                            BANKMASK(T1GCON), 3
#define T1GGO_nDONE                      BANKMASK(T1GCON), 3
#define T1GPOL                           BANKMASK(T1GCON), 6
#define T1GPPS0                          BANKMASK(T1GPPS), 0
#define T1GPPS1                          BANKMASK(T1GPPS), 1
#define T1GPPS2                          BANKMASK(T1GPPS), 2
#define T1GPPS3                          BANKMASK(T1GPPS), 3
#define T1GPPS4                          BANKMASK(T1GPPS), 4
#define T1GSPM                           BANKMASK(T1GCON), 4
#define T1GSS0                           BANKMASK(T1GATE), 0
#define T1GSS1                           BANKMASK(T1GATE), 1
#define T1GSS2                           BANKMASK(T1GATE), 2
#define T1GSS3                           BANKMASK(T1GATE), 3
#define T1GSS4                           BANKMASK(T1GATE), 4
#define T1GTM                            BANKMASK(T1GCON), 5
#define T1GVAL                           BANKMASK(T1GCON), 2
#define T1RD16                           BANKMASK(T1CON), 1
#define T2CKPS0                          BANKMASK(T2CON), 4
#define T2CKPS1                          BANKMASK(T2CON), 5
#define T2CKPS2                          BANKMASK(T2CON), 6
#define T2CPOL                           BANKMASK(T2HLT), 6
#define T2CS0                            BANKMASK(T2CLKCON), 0
#define T2CS1                            BANKMASK(T2CLKCON), 1
#define T2CS2                            BANKMASK(T2CLKCON), 2
#define T2CS3                            BANKMASK(T2CLKCON), 3
#define T2CS4                            BANKMASK(T2CLKCON), 4
#define T2CSYNC                          BANKMASK(T2HLT), 5
#define T2INPPS0                         BANKMASK(T2INPPS), 0
#define T2INPPS1                         BANKMASK(T2INPPS), 1
#define T2INPPS2                         BANKMASK(T2INPPS), 2
#define T2INPPS3                         BANKMASK(T2INPPS), 3
#define T2INPPS4                         BANKMASK(T2INPPS), 4
#define T2MODE0                          BANKMASK(T2HLT), 0
#define T2MODE1                          BANKMASK(T2HLT), 1
#define T2MODE2                          BANKMASK(T2HLT), 2
#define T2MODE3                          BANKMASK(T2HLT), 3
#define T2MODE4                          BANKMASK(T2HLT), 4
#define T2ON                             BANKMASK(T2CON), 7
#define T2OUTPS0                         BANKMASK(T2CON), 0
#define T2OUTPS1                         BANKMASK(T2CON), 1
#define T2OUTPS2                         BANKMASK(T2CON), 2
#define T2OUTPS3                         BANKMASK(T2CON), 3
#define T2PSYNC                          BANKMASK(T2HLT), 7
#define T2RSEL0                          BANKMASK(T2RST), 0
#define T2RSEL1                          BANKMASK(T2RST), 1
#define T2RSEL2                          BANKMASK(T2RST), 2
#define T2RSEL3                          BANKMASK(T2RST), 3
#define T2RSEL4                          BANKMASK(T2RST), 4
#define TMD0                             BANKMASK(ADCON3), 0
#define TMD1                             BANKMASK(ADCON3), 1
#define TMD2                             BANKMASK(ADCON3), 2
#define TMR0H0                           BANKMASK(TMR0H), 0
#define TMR0H1                           BANKMASK(TMR0H), 1
#define TMR0H2                           BANKMASK(TMR0H), 2
#define TMR0H3                           BANKMASK(TMR0H), 3
#define TMR0H4                           BANKMASK(TMR0H), 4
#define TMR0H5                           BANKMASK(TMR0H), 5
#define TMR0H6                           BANKMASK(TMR0H), 6
#define TMR0H7                           BANKMASK(TMR0H), 7
#define TMR0IE                           BANKMASK(PIE0), 5
#define TMR0IF                           BANKMASK(PIR0), 5
#define TMR0L0                           BANKMASK(TMR0L), 0
#define TMR0L1                           BANKMASK(TMR0L), 1
#define TMR0L2                           BANKMASK(TMR0L), 2
#define TMR0L3                           BANKMASK(TMR0L), 3
#define TMR0L4                           BANKMASK(TMR0L), 4
#define TMR0L5                           BANKMASK(TMR0L), 5
#define TMR0L6                           BANKMASK(TMR0L), 6
#define TMR0L7                           BANKMASK(TMR0L), 7
#define TMR0MD                           BANKMASK(PMD0), 7
#define TMR10                            BANKMASK(TMR1L), 0
#define TMR11                            BANKMASK(TMR1L), 1
#define TMR110                           BANKMASK(TMR1H), 2
#define TMR111                           BANKMASK(TMR1H), 3
#define TMR112                           BANKMASK(TMR1H), 4
#define TMR113                           BANKMASK(TMR1H), 5
#define TMR114                           BANKMASK(TMR1H), 6
#define TMR115                           BANKMASK(TMR1H), 7
#define TMR12                            BANKMASK(TMR1L), 2
#define TMR13                            BANKMASK(TMR1L), 3
#define TMR14                            BANKMASK(TMR1L), 4
#define TMR15                            BANKMASK(TMR1L), 5
#define TMR16                            BANKMASK(TMR1L), 6
#define TMR17                            BANKMASK(TMR1L), 7
#define TMR18                            BANKMASK(TMR1H), 0
#define TMR19                            BANKMASK(TMR1H), 1
#define TMR1GIE                          BANKMASK(PIE1), 7
#define TMR1GIF                          BANKMASK(PIR1), 7
#define TMR1H0                           BANKMASK(TMR1H), 0
#define TMR1H1                           BANKMASK(TMR1H), 1
#define TMR1H2                           BANKMASK(TMR1H), 2
#define TMR1H3                           BANKMASK(TMR1H), 3
#define TMR1H4                           BANKMASK(TMR1H), 4
#define TMR1H5                           BANKMASK(TMR1H), 5
#define TMR1H6                           BANKMASK(TMR1H), 6
#define TMR1H7                           BANKMASK(TMR1H), 7
#define TMR1IE                           BANKMASK(PIE1), 6
#define TMR1IF                           BANKMASK(PIR1), 6
#define TMR1L0                           BANKMASK(TMR1L), 0
#define TMR1L1                           BANKMASK(TMR1L), 1
#define TMR1L2                           BANKMASK(TMR1L), 2
#define TMR1L3                           BANKMASK(TMR1L), 3
#define TMR1L4                           BANKMASK(TMR1L), 4
#define TMR1L5                           BANKMASK(TMR1L), 5
#define TMR1L6                           BANKMASK(TMR1L), 6
#define TMR1L7                           BANKMASK(TMR1L), 7
#define TMR1MD                           BANKMASK(PMD1), 0
#define TMR1ON                           BANKMASK(T1CON), 0
#define TMR2IE                           BANKMASK(PIE2), 2
#define TMR2IF                           BANKMASK(PIR2), 2
#define TMR2MD                           BANKMASK(PMD1), 2
#define TMR2ON                           BANKMASK(T2CON), 7
#define TOSH0                            BANKMASK(TOSH), 0
#define TOSH1                            BANKMASK(TOSH), 1
#define TOSH2                            BANKMASK(TOSH), 2
#define TOSH3                            BANKMASK(TOSH), 3
#define TOSH4                            BANKMASK(TOSH), 4
#define TOSH5                            BANKMASK(TOSH), 5
#define TOSH6                            BANKMASK(TOSH), 6
#define TOSH7                            BANKMASK(TOSH), 7
#define TOSL0                            BANKMASK(TOSL), 0
#define TOSL1                            BANKMASK(TOSL), 1
#define TOSL2                            BANKMASK(TOSL), 2
#define TOSL3                            BANKMASK(TOSL), 3
#define TOSL4                            BANKMASK(TOSL), 4
#define TOSL5                            BANKMASK(TOSL), 5
#define TOSL6                            BANKMASK(TOSL), 6
#define TOSL7                            BANKMASK(TOSL), 7
#define TRISA0                           BANKMASK(TRISA), 0
#define TRISA1                           BANKMASK(TRISA), 1
#define TRISA2                           BANKMASK(TRISA), 2
#define TRISA4                           BANKMASK(TRISA), 4
#define TRISA5                           BANKMASK(TRISA), 5
#define TRISC0                           BANKMASK(TRISC), 0
#define TRISC1                           BANKMASK(TRISC), 1
#define TRISC2                           BANKMASK(TRISC), 2
#define TRISC3                           BANKMASK(TRISC), 3
#define TRISC4                           BANKMASK(TRISC), 4
#define TRISC5                           BANKMASK(TRISC), 5
#define TRMT                             BANKMASK(TX1STA), 1
#define TSEN                             BANKMASK(FVRCON), 5
#define TSRNG                            BANKMASK(FVRCON), 4
#define TUN0                             BANKMASK(OSCTUNE), 0
#define TUN1                             BANKMASK(OSCTUNE), 1
#define TUN2                             BANKMASK(OSCTUNE), 2
#define TUN3                             BANKMASK(OSCTUNE), 3
#define TUN4                             BANKMASK(OSCTUNE), 4
#define TUN5                             BANKMASK(OSCTUNE), 5
#define TX1IE                            BANKMASK(PIE4), 6
#define TX1IF                            BANKMASK(PIR4), 6
#define TX9                              BANKMASK(TX1STA), 6
#define TX9D                             BANKMASK(TX1STA), 0
#define TXEN                             BANKMASK(TX1STA), 5
#define UA                               BANKMASK(SSP1STAT), 1
#define UA1                              BANKMASK(SSP1STAT), 1
#define UART1MD                          BANKMASK(PMD3), 1
#define UTH0                             BANKMASK(ADUTHL), 0
#define UTH1                             BANKMASK(ADUTHL), 1
#define UTH10                            BANKMASK(ADUTHH), 2
#define UTH11                            BANKMASK(ADUTHH), 3
#define UTH12                            BANKMASK(ADUTHH), 4
#define UTH13                            BANKMASK(ADUTHH), 5
#define UTH14                            BANKMASK(ADUTHH), 6
#define UTH15                            BANKMASK(ADUTHH), 7
#define UTH2                             BANKMASK(ADUTHL), 2
#define UTH3                             BANKMASK(ADUTHL), 3
#define UTH4                             BANKMASK(ADUTHL), 4
#define UTH5                             BANKMASK(ADUTHL), 5
#define UTH6                             BANKMASK(ADUTHL), 6
#define UTH7                             BANKMASK(ADUTHL), 7
#define UTH8                             BANKMASK(ADUTHH), 0
#define UTH9                             BANKMASK(ADUTHH), 1
#define UTHR                             BANKMASK(ADSTAT), 6
#define WCOL                             BANKMASK(SSP1CON1), 7
#define WCOL1                            BANKMASK(SSP1CON1), 7
#define WDTCS0                           BANKMASK(WDTCON1), 4
#define WDTCS1                           BANKMASK(WDTCON1), 5
#define WDTCS2                           BANKMASK(WDTCON1), 6
#define WDTPS0                           BANKMASK(WDTCON0), 1
#define WDTPS1                           BANKMASK(WDTCON0), 2
#define WDTPS2                           BANKMASK(WDTCON0), 3
#define WDTPS3                           BANKMASK(WDTCON0), 4
#define WDTPS4                           BANKMASK(WDTCON0), 5
#define WDTPSCNT16                       BANKMASK(WDTTMR), 0
#define WDTPSCNT17                       BANKMASK(WDTTMR), 1
#define WDTSEN                           BANKMASK(WDTCON0), 0
#define WDTSTATE                         BANKMASK(WDTTMR), 2
#define WDTTMR0                          BANKMASK(WDTTMR), 3
#define WDTTMR1                          BANKMASK(WDTTMR), 4
#define WDTTMR2                          BANKMASK(WDTTMR), 5
#define WDTTMR3                          BANKMASK(WDTTMR), 6
#define WDTTMR4                          BANKMASK(WDTTMR), 7
#define WDTWINDOW0                       BANKMASK(WDTCON1), 0
#define WDTWINDOW1                       BANKMASK(WDTCON1), 1
#define WDTWINDOW2                       BANKMASK(WDTCON1), 2
#define WINDOW0                          BANKMASK(WDTCON1), 0
#define WINDOW1                          BANKMASK(WDTCON1), 1
#define WINDOW2                          BANKMASK(WDTCON1), 2
#define WPUA0                            BANKMASK(WPUA), 0
#define WPUA1                            BANKMASK(WPUA), 1
#define WPUA2                            BANKMASK(WPUA), 2
#define WPUA3                            BANKMASK(WPUA), 3
#define WPUA4                            BANKMASK(WPUA), 4
#define WPUA5                            BANKMASK(WPUA), 5
#define WPUC0                            BANKMASK(WPUC), 0
#define WPUC1                            BANKMASK(WPUC), 1
#define WPUC2                            BANKMASK(WPUC), 2
#define WPUC3                            BANKMASK(WPUC), 3
#define WPUC4                            BANKMASK(WPUC), 4
#define WPUC5                            BANKMASK(WPUC), 5
#define WR                               BANKMASK(NVMCON1), 1
#define WREN                             BANKMASK(NVMCON1), 2
#define WRERR                            BANKMASK(NVMCON1), 3
#define WUE                              BANKMASK(BAUD1CON), 1
#define XOR0                             BANKMASK(CRCXORL), 0
#define XOR1                             BANKMASK(CRCXORL), 1
